app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

    def update
        @user = User.find(params[:id])
        if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "friday" = $1, "saturday" = $2, "sunday" = $3, "diet" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["friday", "No"], ["saturday", "No"], ["sunday", "No"], ["diet", "Vegan"], ["updated_at", "2021-07-22 21:40:13.015406"], ["id", 7]]